app/Controllers/Login.php

SELECT *
FROM `user`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
---
    public function create()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Load the authentication library which we created earlier in app\Libraries\Authentication.php
        $auth = new  \App\Libraries\Authentication; // Old way without services
        //$auth = Services::auth(); // New way with services 1
        $auth = service('auth'); // New way with services 2

        // Load the model
        $model = new \App\Models\UserModel();
        // Get the user from the database
        $user = $model->findByEmail($email);