app/Controllers/Tasks.php

    public function create() {
        //Before inserting we need to validate the form in the model
        //$model = new \App\Models\TaskModel();
        // Get the data from the form
        // Request is a class that is available to us that will help us get the data from the form wihtout needing to check if the value is set
        //$description = $this->request->getPost('description');
        // We can just pass the whole request object to the model and it will take care of the rest.
        $task = new Task($this->request->getPost());
        //$data = [
        //    'description' => $description
        //];
        // Insert the data into the database
        //$result = $model->insert($task); <-- This is the old way
        //dd($result);
        if($this->model->insert($task)) {
---
INSERT INTO `tasks` (`description`, `created_at`, `updated_at`) VALUES ('123213', '2023-07-10 16:24:25', '2023-07-10 16:24:25')

    public function update($id) {
        //$model = new \App\Models\TaskModel();
        $task = $this->model->find($id);

        //This is the new way to fill the data from the form directly into the object after it u need to save it
        $task->fill($this->request->getPost());

        //$model->save($task); // <-- This is the new way

        //$description = $this->request->getPost('description');

        //$data = [
        //    'description' => $description                 All old way
        //];
        //$result = $model->update($id, $data);
        // Before updating we need to validate if the any data has been changed
        if(!$task->hasChanged()){

            return  redirect()->back()->with('warning', 'No changes made')->withInput();
        }
            if($this->model->save($task)) { // <--- new way here into the if statement
---
UPDATE `tasks` SET `description` = '123213123', `updated_at` = '2023-07-10 16:27:27'
WHERE `tasks`.`id` IN ('5')