app/Models/UserModel.php

    public function findByEmail($email) {

        return $this->where('email', $email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1