app/Libraries/Authentication.php

    public function getCurrentUser() {

        if(!$this->isLoggedIn()) {
            return null;
        }
        // If we have already retrieved this user, don't retrieve it again this is called caching
        if($this->user === null) {

        $model = new \App\Models\UserModel();
        return $this->user= $model->find(session()->get('user_id'));
---
SELECT *
FROM `user`
WHERE `user`.`id` = '14'